johnnybahia/tempos-de-m-quinas/esp32_48fusos.ino
// ============================================================
// MONITOR DE MÁQUINAS — MARFIM
// Versão 4.4 — 48 Fusos (Unimat e Chinesa)
// Correções: timeout HTTP real, follow-redirects, descarte de
// eventos envenenados, heartbeat nunca persistido, guarda de heap,
// checkpoint horário (máquina que roda sem parar não fica sem
// registrar produção), removido o conceito de "sensor travado"
// (sinal vem de relé — biestável, não trava fisicamente).
// ============================================================

#include <WiFi.h>
#include <HTTPClient.h>
#include <WiFiClientSecure.h>
#include <esp_task_wdt.h>
#include <Preferences.h>
#include <LittleFS.h>
#include <ArduinoJson.h>

// ============================================================
// BLOCO 1 — CONFIGURAÇÕES DE REDE
// ============================================================
#define WIFI_SSID     "MARFIM_PRODUCAO"
#define WIFI_PASSWORD "Marfimm0403"

// ============================================================
// BLOCO 2 — URL DO GOOGLE APPS SCRIPT
// ============================================================
#define GOOGLE_SCRIPT_URL \
  "https://script.google.com/macros/s/AKfycbyoMZd9g_A7IIgcCajQm71OZTEf6R4kMWQvJXy79C6W8MR24OH_Q2sQ9-uko1q9uvH8fg/exec"

// ============================================================
// BLOCO 3 — CADASTRO DE MÁQUINAS
// ============================================================
#define QTD_MAQUINAS 8

struct Maquina {
  const char* nome;
  int pino;
};

// Utilizando pinos seguros para INPUT_PULLUP no ESP32
const Maquina MAQUINAS[QTD_MAQUINAS] = {
  { "48 FUSOS UNIMAT 1",  13 },
  { "48 FUSOS UNIMAT 2",  14 },
  { "48 FUSOS UNIMAT 3",  25 },
  { "48 FUSOS UNIMAT 4",  26 },
  { "48 FUSOS UNIMAT 5",  27 },
  { "48 FUSOS CHINESA 1", 32 },
  { "48 FUSOS CHINESA 2", 33 },
  { "48 FUSOS CHINESA 3", 22 },
};

// ============================================================
// BLOCO 4 — PARÂMETROS OPERACIONAIS
// ============================================================
#define DEBOUNCE_MS              50
#define DURACAO_MINIMA_MS        1000
#define CHECKPOINT_INTERVALO_MS  3600000UL  // 1 hora — ver taskEnviarGoogle/loop()
#define HEARTBEAT_INTERVALO_MS   600000UL
#define FILA_TAMANHO             50
#define WATCHDOG_TIMEOUT_S       120
#define DELAY_ALEATORIO_MAX_MS   8000
#define STACK_WIFI_TASK          20000

// HTTP
#define HTTP_MAX_TENTATIVAS      3
#define HTTP_TIMEOUT_MS          20000UL   // read timeout REAL (HTTPClient, ms)
#define HTTP_TIMEOUT_S           20        // WiFiClientSecure usa SEGUNDOS
#define HTTP_HANDSHAKE_TIMEOUT_S 15
#define HTTP_BACKOFF_BASE_MS     2000UL
#define HEAP_MINIMO_TLS          55000UL   // abaixo disso o handshake TLS falha

// LittleFS
#define LITTLEFS_EVENTOS_PATH   "/eventos.log"
#define LITTLEFS_TMP_PATH       "/eventos_tmp.log"
#define LITTLEFS_MAX_BYTES      1400000UL
#define FS_MAX_FALHAS_EVENTO    15        // após isso o evento é descartado
#define FS_BACKOFF_BASE_MS      5000UL
#define FS_BACKOFF_MAX_MS       60000UL

// ============================================================
// ESTRUTURAS E VARIÁVEIS
// ============================================================
struct EventoData {
  int maquinaIndex;
  bool produzindo;
  unsigned long duracaoMs;
  bool ehHeartbeat;
  bool ehEstadoInicial;
};

int estadoAtual[QTD_MAQUINAS];
unsigned long tempoInicio[QTD_MAQUINAS];
unsigned long lastDebounceTime[QTD_MAQUINAS];
int leituraDebounce[QTD_MAQUINAS];
unsigned long ultimoCheckpoint[QTD_MAQUINAS];

volatile uint32_t eventosEnviados    = 0;
volatile uint32_t eventosPerdidos    = 0;
volatile uint32_t errosHTTP          = 0;
volatile uint32_t reconexoesWiFi     = 0;
volatile uint32_t eventosPersistidos = 0;
volatile uint32_t eventosDescartados = 0;

uint32_t falhasEventoAtualFS = 0;   // falhas consecutivas do evento no topo do arquivo

unsigned long ultimoHeartbeat = 0;
QueueHandle_t filaEnvios;
Preferences prefs;
SemaphoreHandle_t littlefsMutex = NULL;

// ============================================================
// UTILIDADES
// ============================================================

void delayComWdt(uint32_t ms) {
  uint32_t restante = ms;
  while (restante > 0) {
    uint32_t passo = (restante > 1000) ? 1000 : restante;
    vTaskDelay(pdMS_TO_TICKS(passo));
    esp_task_wdt_reset();
    restante -= passo;
  }
}

// ============================================================
// NVS — SALVAR E RECUPERAR ESTADO NA FLASH
// ============================================================

void nvsSalvarEstado(int idx, int estado, unsigned long msInicio) {
  char keyEst[12], keyMs[12];
  snprintf(keyEst, sizeof(keyEst), "est_%d", idx);
  snprintf(keyMs,  sizeof(keyMs),  "ms_%d",  idx);
  prefs.begin("marfim", false);
  prefs.putInt(keyEst, estado);
  prefs.putULong(keyMs, msInicio);
  prefs.end();
}

void nvsSalvarMomentoDoBootAtual() {
  unsigned long agora = millis();
  prefs.begin("marfim", false);
  for (int i = 0; i < QTD_MAQUINAS; i++) {
    char keyMsb[12];
    snprintf(keyMsb, sizeof(keyMsb), "msb_%d", i);
    prefs.putULong(keyMsb, agora);
  }
  prefs.end();
  Serial.println("  [NVS] Momento do boot salvo.");
}

bool nvsLerEstado(int idx, int* estado, unsigned long* msInicio, unsigned long* msBootAnterior) {
  char keyEst[12], keyMs[12], keyMsb[12];
  snprintf(keyEst,  sizeof(keyEst),  "est_%d", idx);
  snprintf(keyMs,   sizeof(keyMs),   "ms_%d",  idx);
  snprintf(keyMsb,  sizeof(keyMsb),  "msb_%d", idx);
  prefs.begin("marfim", true);
  bool temDado = prefs.isKey(keyEst);
  if (temDado) {
    *estado         = prefs.getInt(keyEst, HIGH);
    *msInicio       = prefs.getULong(keyMs, 0);
    *msBootAnterior = prefs.getULong(keyMsb, 0);
  }
  prefs.end();
  return temDado;
}

// ============================================================
// LITTLEFS — PERSISTÊNCIA OFFLINE DE EVENTOS
// ============================================================

String serializarEvento(const EventoData& ev) {
  StaticJsonDocument<128> doc;
  doc["m"] = ev.maquinaIndex;
  doc["p"] = ev.produzindo ? 1 : 0;
  doc["d"] = ev.duracaoMs;
  if (ev.ehEstadoInicial) doc["t"] = "EI";
  else                    doc["t"] = "EV";
  String linha;
  serializeJson(doc, linha);
  linha += "\n";
  return linha;
}

bool deserializarEvento(const String& linha, EventoData& ev) {
  StaticJsonDocument<128> doc;
  if (deserializeJson(doc, linha) != DeserializationError::Ok) return false;
  if (!doc.containsKey("m") || !doc.containsKey("t")) return false;

  int idx = doc["m"] | -1;
  if (idx < 0 || idx >= QTD_MAQUINAS) return false;

  ev.maquinaIndex    = idx;
  ev.produzindo      = (doc["p"].as<int>() == 1);
  ev.duracaoMs       = doc["d"].as<unsigned long>();
  const char* tipo   = doc["t"] | "";
  ev.ehHeartbeat     = (strcmp(tipo, "HB") == 0);
  ev.ehEstadoInicial = (strcmp(tipo, "EI") == 0);
  return true;
}

void persistirEventoLittleFS(const EventoData& ev) {
  if (ev.ehHeartbeat) { return; }
  if (littlefsMutex == NULL) return;
  if (xSemaphoreTake(littlefsMutex, pdMS_TO_TICKS(3000)) != pdTRUE) return;

  size_t tamanhoAtual = 0;
  File fCheck = LittleFS.open(LITTLEFS_EVENTOS_PATH, "r");
  if (fCheck) { tamanhoAtual = fCheck.size(); fCheck.close(); }

  if (tamanhoAtual >= LITTLEFS_MAX_BYTES) {
    File fOld = LittleFS.open(LITTLEFS_EVENTOS_PATH, "r");
    File fNew = LittleFS.open(LITTLEFS_TMP_PATH, "w");
    if (fOld && fNew) {
      int descartadas = 0;
      while (fOld.available()) {
        String linha = fOld.readStringUntil('\n');
        linha.trim();
        if (descartadas < 50) { descartadas++; continue; }
        if (linha.length() > 2) { fNew.print(linha); fNew.print('\n'); }
      }
      fOld.close();
      fNew.close();
      LittleFS.remove(LITTLEFS_EVENTOS_PATH);
      LittleFS.rename(LITTLEFS_TMP_PATH, LITTLEFS_EVENTOS_PATH);
      eventosDescartados += descartadas;
      falhasEventoAtualFS = 0;
      Serial.printf("  [FS] Rotacao: %d linhas descartadas.\n", descartadas);
    } else {
      if (fOld) fOld.close();
      if (fNew) fNew.close();
    }
  }

  File f = LittleFS.open(LITTLEFS_EVENTOS_PATH, "a");
  if (f) {
    f.print(serializarEvento(ev));
    f.close();
    eventosPersistidos++;
    Serial.printf("  [FS] Evento persistido. Total: %u\n", eventosPersistidos);
  } else {
    Serial.println("xx [FS] Falha ao abrir arquivo para escrita.");
  }

  xSemaphoreGive(littlefsMutex);
}

uint32_t contarEventosPersistidos() {
  if (littlefsMutex == NULL) return 0;
  if (xSemaphoreTake(littlefsMutex, pdMS_TO_TICKS(3000)) != pdTRUE) return 0;

  uint32_t count = 0;
  if (LittleFS.exists(LITTLEFS_EVENTOS_PATH)) {
    File f = LittleFS.open(LITTLEFS_EVENTOS_PATH, "r");
    if (f) {
      while (f.available()) {
        String l = f.readStringUntil('\n');
        l.trim();
        if (l.length() > 2) count++;
      }
      f.close();
    }
  }

  xSemaphoreGive(littlefsMutex);
  return count;
}

void removerPrimeiraLinhaLittleFS() {
  if (littlefsMutex == NULL) return;
  if (xSemaphoreTake(littlefsMutex, pdMS_TO_TICKS(3000)) != pdTRUE) return;

  File fOld = LittleFS.open(LITTLEFS_EVENTOS_PATH, "r");
  File fNew = LittleFS.open(LITTLEFS_TMP_PATH, "w");

  if (fOld && fNew) {
    bool primeiraPulada = false;
    while (fOld.available()) {
      String linha = fOld.readStringUntil('\n');
      linha.trim();
      if (linha.length() <= 2) continue;
      if (!primeiraPulada) { primeiraPulada = true; continue; }
      fNew.print(linha);
      fNew.print('\n');
    }
    fOld.close();
    fNew.close();
    LittleFS.remove(LITTLEFS_EVENTOS_PATH);
    LittleFS.rename(LITTLEFS_TMP_PATH, LITTLEFS_EVENTOS_PATH);
  } else {
    if (fOld) fOld.close();
    if (fNew) fNew.close();
  }

  falhasEventoAtualFS = 0;
  xSemaphoreGive(littlefsMutex);
}

int lerPrimeiroEventoLittleFS(EventoData& ev) {
  if (littlefsMutex == NULL) return 0;
  if (xSemaphoreTake(littlefsMutex, pdMS_TO_TICKS(3000)) != pdTRUE) return 0;

