johnnybahia/tempos-de-m-quinas/esp32_48fusos.ino
  int resultado = 0;
  if (LittleFS.exists(LITTLEFS_EVENTOS_PATH)) {
    File f = LittleFS.open(LITTLEFS_EVENTOS_PATH, "r");
    if (f) {
      String linha = "";
      while (f.available()) {
        linha = f.readStringUntil('\n');
        linha.trim();
        if (linha.length() > 2) break;
      }
      f.close();
      if (linha.length() > 2) {
        resultado = deserializarEvento(linha, ev) ? 1 : -1;
      }
    }
  }

  xSemaphoreGive(littlefsMutex);
  return resultado;
}

// ============================================================
// FUNÇÕES AUXILIARES
// ============================================================

String urlEncode(const String& s) {
  String enc = "";
  for (int i = 0; i < s.length(); i++) {
    char c = s.charAt(i);
    if (c == ' ') enc += "%20";
    else if (isAlphaNumeric(c) || c == '-' || c == '_' || c == '.' || c == '/') enc += c;
    else {
      char buf[4];
      snprintf(buf, sizeof(buf), "%%%02X", (unsigned char)c);
      enc += buf;
    }
  }
  return enc;
}

String montarURL(int idx, const char* evento, unsigned long duracaoMs) {
  String url = GOOGLE_SCRIPT_URL;
  url += "?maquina=" + urlEncode(String(MAQUINAS[idx].nome));
  url += "&evento="  + urlEncode(String(evento));
  url += "&duracao=" + String(duracaoMs / 1000.0, 2);
  return url;
}

bool enviarHTTP(const String& url) {
  for (int tentativa = 1; tentativa <= HTTP_MAX_TENTATIVAS; tentativa++) {
    esp_task_wdt_reset();

    uint32_t heap = ESP.getFreeHeap();
    if (heap < HEAP_MINIMO_TLS) {
      Serial.printf("xx [HTTP] Heap insuficiente para TLS (%u bytes). Abortando envio.\n", heap);
      errosHTTP++;
      return false;
    }

    WiFiClientSecure client;
    client.setInsecure();
    client.setTimeout(HTTP_TIMEOUT_S);
    client.setHandshakeTimeout(HTTP_HANDSHAKE_TIMEOUT_S);

    HTTPClient http;
    if (!http.begin(client, url)) {
      Serial.println("xx [HTTP] http.begin() falhou.");
      errosHTTP++;
      delayComWdt(HTTP_BACKOFF_BASE_MS);
      continue;
    }

    http.setTimeout(HTTP_TIMEOUT_MS);
    http.setConnectTimeout(HTTP_TIMEOUT_MS);
    http.setReuse(false);
    http.setFollowRedirects(HTTPC_STRICT_FOLLOW_REDIRECTS);

    int httpCode = http.GET();
    String body = "";
    if (httpCode > 0) {
      body = http.getString();
      body.trim();
      if (body.length() > 60) body = body.substring(0, 60);
    }
    http.end();

    if (httpCode == HTTP_CODE_OK && body != "BUSY") {
      return true;
    }

    Serial.printf("xx [HTTP] Tentativa %d/%d falhou (codigo %d | heap %u | body: %s)\n",
                  tentativa, HTTP_MAX_TENTATIVAS, httpCode, heap, body.c_str());
    errosHTTP++;

    if (tentativa < HTTP_MAX_TENTATIVAS) {
      delayComWdt(HTTP_BACKOFF_BASE_MS * tentativa);
    }
  }
  return false;
}

bool reconectarWiFi() {
  if (WiFi.status() == WL_CONNECTED) return true;
  Serial.println("!! [WiFi] Desconectado. Reconectando...");
  WiFi.disconnect();
  vTaskDelay(pdMS_TO_TICKS(1000));
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
  int espera = 0;
  while (WiFi.status() != WL_CONNECTED && espera < 50) {
    vTaskDelay(pdMS_TO_TICKS(1000));
    espera++;
    Serial.printf("  [WiFi] Aguardando... (%ds)\n", espera);
    esp_task_wdt_reset();
  }
  if (WiFi.status() == WL_CONNECTED) {
    Serial.println(">> [WiFi] Reconectado! IP: " + WiFi.localIP().toString());
    reconexoesWiFi++;
    return true;
  }
  nvsSalvarMomentoDoBootAtual();
  Serial.println("!! [WiFi] Falha apos 50s. Reiniciando...");
  vTaskDelay(pdMS_TO_TICKS(500));
  ESP.restart();
  return false;
}

void enfileirarOuPersistir(const EventoData& ev) {
  if (xQueueSend(filaEnvios, &ev, 0) != pdTRUE) {
    eventosPerdidos++;
    persistirEventoLittleFS(ev);
  }
}

String montarURLHeartbeat() {
  int32_t rssi = WiFi.RSSI();
  String url  = String(GOOGLE_SCRIPT_URL);
  url += "?evento=HEARTBEAT";
  url += "&enviados="    + String(eventosEnviados);
  url += "&perdidos="    + String(eventosPerdidos);
  url += "&errosHTTP="   + String(errosHTTP);
  url += "&rssi="        + String(rssi);
  url += "&reconexoes="  + String(reconexoesWiFi);
  url += "&persistidos=" + String(eventosPersistidos);
  url += "&descartados=" + String(eventosDescartados);
  url += "&fsPendentes=" + String(contarEventosPersistidos());
  url += "&heap="        + String(ESP.getFreeHeap());
  return url;
}

// ============================================================
// TASK CORE 0 — ENVIO WiFi
// ============================================================

void taskEnviarGoogle(void* parameter) {
  esp_task_wdt_add(NULL);
  EventoData pacote;
  randomSeed(ESP.getEfuseMac());

  while (true) {
    esp_task_wdt_reset();

    // ---------- Drenagem do LittleFS ----------
    EventoData evFS;
    int statusFS = lerPrimeiroEventoLittleFS(evFS);

    if (statusFS == -1) {
      Serial.println("xx [FS] Linha corrompida detectada. Removendo.");
      removerPrimeiraLinhaLittleFS();
      eventosDescartados++;
      continue;
    }

    if (statusFS == 1) {
      if (evFS.ehHeartbeat) {
        Serial.println("  [FS] Heartbeat legado descartado.");
        removerPrimeiraLinhaLittleFS();
        eventosDescartados++;
        continue;
      }

      if (reconectarWiFi()) {
        String url, nomeLog;
        if (evFS.ehEstadoInicial) {
          const char* ev2 = evFS.produzindo ? "ESTADO INICIAL PRODUZINDO" : "ESTADO INICIAL PARADA";
          url     = montarURL(evFS.maquinaIndex, ev2, 0);
          nomeLog = String("[FS-BOOT] ") + MAQUINAS[evFS.maquinaIndex].nome;
        } else {
          const char* ev2 = evFS.produzindo ? "TEMPO PRODUZINDO" : "TEMPO PARADA";
          url     = montarURL(evFS.maquinaIndex, ev2, evFS.duracaoMs);
          nomeLog = String("[FS-EV] ") + MAQUINAS[evFS.maquinaIndex].nome +
                    " - " + String(evFS.duracaoMs / 1000.0, 1) + "s";
        }

        Serial.println(">> " + nomeLog);

        if (enviarHTTP(url)) {
          eventosEnviados++;
          removerPrimeiraLinhaLittleFS();
          Serial.println("<< FS Sucesso.");
        } else {
          falhasEventoAtualFS++;
          if (falhasEventoAtualFS >= FS_MAX_FALHAS_EVENTO) {
            Serial.printf("xx [FS] Evento descartado apos %u falhas (envenenado).\n",
                          falhasEventoAtualFS);
            removerPrimeiraLinhaLittleFS();
            eventosDescartados++;
          } else {
            uint32_t backoff = FS_BACKOFF_BASE_MS * falhasEventoAtualFS;
            if (backoff > FS_BACKOFF_MAX_MS) backoff = FS_BACKOFF_MAX_MS;
            Serial.printf("xx [FS] Falha %u/%u - aguardando %ums.\n",
                          falhasEventoAtualFS, (uint32_t)FS_MAX_FALHAS_EVENTO, backoff);
            delayComWdt(backoff);
          }
        }
      }
      esp_task_wdt_reset();
      continue;
    }

