johnnybahia/tempos-de-m-quinas/esp32_48fusos.ino
    // ---------- Fila RAM ----------
    if (xQueueReceive(filaEnvios, &pacote, pdMS_TO_TICKS(1000))) {
      if (!reconectarWiFi()) {
        persistirEventoLittleFS(pacote);
        continue;
      }

      if (!pacote.ehHeartbeat) {
        delayComWdt(random(0, DELAY_ALEATORIO_MAX_MS));
      }

      String url, nomeLog;

      if (pacote.ehHeartbeat) {
        url     = montarURLHeartbeat();
        nomeLog = "[HEARTBEAT] RSSI:" + String(WiFi.RSSI()) +
                  "dBm | Heap:" + String(ESP.getFreeHeap());
      }
      else if (pacote.ehEstadoInicial) {
        const char* ev = pacote.produzindo ? "ESTADO INICIAL PRODUZINDO" : "ESTADO INICIAL PARADA";
        url     = montarURL(pacote.maquinaIndex, ev, 0);
        nomeLog = String("[BOOT] ") + MAQUINAS[pacote.maquinaIndex].nome;
      }
      else {
        const char* ev = pacote.produzindo ? "TEMPO PRODUZINDO" : "TEMPO PARADA";
        url      = montarURL(pacote.maquinaIndex, ev, pacote.duracaoMs);
        nomeLog  = String(pacote.produzindo ? "[PROD] " : "[PARADA] ");
        nomeLog += MAQUINAS[pacote.maquinaIndex].nome;
        nomeLog += " - " + String(pacote.duracaoMs / 1000.0, 1) + "s";
      }

      Serial.println(">> " + nomeLog);

      if (enviarHTTP(url)) {
        eventosEnviados++;
        Serial.println("<< Sucesso.");
      } else if (pacote.ehHeartbeat) {
        Serial.println("xx Heartbeat perdido (nao persistido).");
      } else {
        persistirEventoLittleFS(pacote);
        Serial.println("xx HTTP falhou - persistido no FS.");
      }
    }

    esp_task_wdt_reset();
  }
}

// ============================================================
// SETUP
// ============================================================

void setup() {
  Serial.begin(115200);
  Serial.println("\n===== MONITOR MARFIM v4.4 - 48 FUSOS =====");

  littlefsMutex = xSemaphoreCreateMutex();

  if (!LittleFS.begin(true)) {
    Serial.println("xx [FS] LittleFS falhou! Operando sem persistencia offline.");
  } else {
    Serial.printf("  [FS] LittleFS OK. Eventos pendentes: %u\n", contarEventosPersistidos());
  }

  for (int i = 0; i < QTD_MAQUINAS; i++) {
    pinMode(MAQUINAS[i].pino, INPUT_PULLUP);
    estadoAtual[i]      = digitalRead(MAQUINAS[i].pino);
    leituraDebounce[i]  = estadoAtual[i];
    tempoInicio[i]      = millis();
    lastDebounceTime[i] = millis();
    ultimoCheckpoint[i] = millis();
  }

  WiFi.mode(WIFI_STA);
  WiFi.setSleep(false);
  WiFi.config(INADDR_NONE, INADDR_NONE, INADDR_NONE, IPAddress(8, 8, 8, 8));
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  Serial.print("Conectando WiFi");
  int t = 0;
  while (WiFi.status() != WL_CONNECTED && t < 30) {
    delay(500);
    Serial.print(".");
    t++;
  }

  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("\n!! WiFi falhou no boot. Salvando NVS e continuando offline...");
    nvsSalvarMomentoDoBootAtual();
  } else {
    Serial.println("\nConectado! IP: " + WiFi.localIP().toString());
  }

  Serial.printf("  [MEM] Heap livre apos WiFi: %u bytes\n", ESP.getFreeHeap());

  filaEnvios = xQueueCreate(FILA_TAMANHO, sizeof(EventoData));

#if ESP_ARDUINO_VERSION_MAJOR >= 3
  esp_task_wdt_config_t wdt_config = {
    .timeout_ms     = WATCHDOG_TIMEOUT_S * 1000,
    .idle_core_mask = 0,
    .trigger_panic  = true
  };
  esp_task_wdt_reconfigure(&wdt_config);
#else
  esp_task_wdt_init(WATCHDOG_TIMEOUT_S, true);
#endif
  esp_task_wdt_add(NULL);

  xTaskCreatePinnedToCore(taskEnviarGoogle, "WiFiTask", STACK_WIFI_TASK, NULL, 1, NULL, 0);

  Serial.println("Verificando NVS...");
  for (int i = 0; i < QTD_MAQUINAS; i++) {
    int eS = HIGH;
    unsigned long mI = 0, mB = 0;

    if (nvsLerEstado(i, &eS, &mI, &mB) && mB > mI) {
      unsigned long dur = mB - mI;
      if (dur >= DURACAO_MINIMA_MS && dur < 86400000UL) {
        Serial.printf("  [NVS] %s - recuperado %.1fs %s\n",
                      MAQUINAS[i].nome, dur / 1000.0,
                      (eS == LOW) ? "PRODUZINDO" : "PARADA");
        EventoData ev = { i, (eS == LOW), dur, false, false };
        enfileirarOuPersistir(ev);
      } else {
        Serial.printf("  [NVS] %s - duracao invalida (%.1fs). Ignorado.\n",
                      MAQUINAS[i].nome, dur / 1000.0);
      }
    } else {
      Serial.printf("  [NVS] %s - sem recuperacao.\n", MAQUINAS[i].nome);
    }

    nvsSalvarEstado(i, estadoAtual[i], millis());

    EventoData bootEv = { i, (estadoAtual[i] == LOW), 0, false, true };
    enfileirarOuPersistir(bootEv);
  }

  ultimoHeartbeat = millis();

  Serial.println("Sistema iniciado! Monitorando " + String(QTD_MAQUINAS) + " maquinas.");
  for (int i = 0; i < QTD_MAQUINAS; i++) {
    Serial.printf("  GPIO %2d -> %s [%s]\n",
                  MAQUINAS[i].pino,
                  MAQUINAS[i].nome,
                  estadoAtual[i] == LOW ? "PRODUZINDO" : "PARADA");
  }
}

// ============================================================
// LOOP PRINCIPAL (CORE 1) — LEITURA GPIO
// ============================================================

void loop() {
  esp_task_wdt_reset();
  unsigned long agora = millis();

  if (agora - ultimoHeartbeat >= HEARTBEAT_INTERVALO_MS) {
    ultimoHeartbeat = agora;
    EventoData hb = { 0, false, 0, true, false };
    if (xQueueSend(filaEnvios, &hb, 0) != pdTRUE) eventosPerdidos++;
  }

  for (int i = 0; i < QTD_MAQUINAS; i++) {
    int leitura = digitalRead(MAQUINAS[i].pino);

    if (leitura != leituraDebounce[i]) {
      lastDebounceTime[i] = agora;
      leituraDebounce[i]  = leitura;
    }

    if ((agora - lastDebounceTime[i]) >= DEBOUNCE_MS) {
      if (leitura != estadoAtual[i]) {
        unsigned long duracaoMs = lastDebounceTime[i] - tempoInicio[i];

        if (duracaoMs >= DURACAO_MINIMA_MS) {
          EventoData ev = { i, (estadoAtual[i] == LOW), duracaoMs, false, false };
          enfileirarOuPersistir(ev);
          Serial.printf(">> Evento: %s | %s | %.1fs\n",
                        MAQUINAS[i].nome,
                        estadoAtual[i] == LOW ? "PRODUZINDO" : "PARADA",
                        duracaoMs / 1000.0);
        } else {
          Serial.printf("  [RUIDO] %s | %.0fms\n", MAQUINAS[i].nome, (float)duracaoMs);
        }

        estadoAtual[i]      = leitura;
        tempoInicio[i]      = lastDebounceTime[i];
        ultimoCheckpoint[i] = lastDebounceTime[i];
        nvsSalvarEstado(i, estadoAtual[i], millis());
      }
    }

    // Checkpoint: uma trançadeira pode rodar horas seguidas sem nunca mudar
    // de estado — sem isso, um evento só é enviado quando ela finalmente
    // para, e um turno inteiro passado no meio de uma corrida longa fica
    // sem nenhum dado. A cada CHECKPOINT_INTERVALO_MS, reporta o tempo
    // decorrido desde o último relato como um evento normal (produzindo ou
    // parada, o que estiver valendo) e reinicia a contagem a partir de
    // agora — sem tocar em estadoAtual[i], porque o estado físico não mudou.
    if ((agora - ultimoCheckpoint[i]) >= CHECKPOINT_INTERVALO_MS) {
      unsigned long duracaoMs = agora - tempoInicio[i];
      if (duracaoMs >= DURACAO_MINIMA_MS) {
        EventoData cp = { i, (estadoAtual[i] == LOW), duracaoMs, false, false };
        enfileirarOuPersistir(cp);
        Serial.printf(">> Checkpoint: %s | %s | %.1fs\n",
                      MAQUINAS[i].nome,
                      estadoAtual[i] == LOW ? "PRODUZINDO" : "PARADA",
                      duracaoMs / 1000.0);
      }
      tempoInicio[i]      = agora;
      ultimoCheckpoint[i] = agora;
      nvsSalvarEstado(i, estadoAtual[i], millis());
    }
  }

  vTaskDelay(pdMS_TO_TICKS(1));
}
